Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Romance Punch.tmx
Source language: id
Languages: en

source: TANGKAP
en: get

source: SKRIP!
en: the script!

source: AKU
en: I’m

source: SEJAK KAPAN
en: since when you two

source: OH, INI TANGGAL ASLINYA!
en: No, trust me! Today’s their real anniversary!

source: SUDAH HABIS…
en: my limit...

source: DUH, MANA SEKARANG
en: Ugh... I shouldn’t have

source: IYA,
en: yeah,

source: KE PILAR BESI.
en: her my regards.

source: TENANG AMEL…
en: calm down, amel...

source: TIBA-TIBA BANGET!
en: why so sudden?

source: BISA KUTONJOK
en: her face

source: TES, PADA DENGER GUA, KAN?!
en: test, can you guys hear me?!

source: BIARIN AJA BERANTEM,
en: let stray cats fight,

source: HARI KELULUSANNYA
en: for her graduation

source: DI POSISI?
en: position?

source: MUKANYA MERAH…
en: her face is so red...

source: DEG
en: thump

source: ENTAH APA
en: I didn’t know

source: SATU CEWEK
en: even someone

source: KUTERIMA
en: I’ll

source: SAMA COWOK?!
en: do that just because he was handsome!

source: TERJADI?!
en: going on?!

source: SENJATA RAHASIA
en: a secret weapon

source: MA-MASA
en: N-

source: SUDAH
en: it’s been

source: HAJAR SEMUANYA!
en: let’s just beat them all!

source: KAMU MASIH PERLU
en: You still have much

source: MAMA?
en: mom?

source: BAGUS!
en: great!

source: NAMBAH SATU
en: Tsk...

source: EH?!
en: huh?!

source: TUH BOCAH-BOCAH UDAH PADA NAFSU, MUKUL MEREKA AJA GUA JIJIK!
en: those roaches wouldn’t budge at all! I didn’t even want to hit those disgusting scums!

source: EH, RATU…
en: (incorrect segments, translation moved to the missing text sheet)

source: SEKALIAN
en: and your

source: BERANI MENYENTUH
en: to touch

source: SEMUA, SELAIN
en: her story

source: 12:00 AM ISTANA NEGARA
en: the presidential palace, 12:00 a.m.

source: BEBERAPA HARI BERLALU SEJAK AKSI MATA-MATA AKU DAN PUTRA.
en: several days have passed since Putra and I spied on amel.

source: DENGAN INI "PROM" DIMULAI!
en: the prom starts now!

source: LAGIAN
en: after all,

source: SIUL
en: whistle

source: KALIAN SEMUA MINTA TES DNA,
en: you people have been begging me to take a DNA test, right?

source: TUMBANG DI SINI,
en: taken care of.

source: DAS
en: bam

source: KITAB KEPO twoce
en: curious note twoce

source: DULU DIA
en: he was the rival

source: MERAIHNYA!
en: him!

source: NAMUN
en: Weirdly enough,

source: TEX PASTI LAGI SIBUK SAMA GITARNYA, LU DENGER SENDIRI SUARANYA.
en: tex must be busy with his guitar. I’m pretty sure you can hear him.

source: KALIAN ANAK-ANAK NAKAL
en: you wretched boys

source: KELIHATAN KOK
en: we can see it

source: BIASANYA OM BOTAK
en: I thought

source: AKU BAKAL MEMPERTAHANKAN ACARA INI DENGAN CARAKU SENDIRI!
en: I’ll guard the prom with my own way!

source: BODOH,
en: fool...

source: SIAL, ELU SIH,
en: Crap, you really had to

source: KAMU, KAN!
en: you!

source: PAGAR AYU?!
en: let you get through us, huh?!

source: INI...
en: hair...

source: MASIH NGUTANG
en: owe you

source: WELL…
en: well, well, well...

source: BOSAN GUA, MAU NGECEK ADEK GUA, NIH!
en: I’m bored, I want to check on my sister!

source: PARAH BANGET
en: what’s wrong with

source: SIANG NANTI PALING UDAH BERES.
en: It’ll be over by noon.

source: BAHKAN SAAT HARGA DIRINYA DIINJAK-INJAK.
en: even when we mess with his dignity...

source: MALAH DIKERJAIN
en: were

source: BUNUH ORANG.
en: not to kill people,

source: GAK PERNAH
en: never

source: SEBELUM---
en: before--

source: BUAT KALIAN!
en: to take your heads!

source: TEMAN FAVORITKU
en: he’s still my number one

source: UNTUK
en: anything

source: HAH?
en: what?

source: WAKTU!
en: here!

source: KENAPA?
en: your hand?

source: CREK
en: crack

source: KAK AMEL?
en: amel?

source: WALAU SEKARANG
en: even though we’re

source: SEMENTARA ITU DI HUTAN.
en: meanwhile in the forest.

source: DULU!
en: you up first!

source: PUTRA, DAN NARA PAMIT DULU YA!
en: putra, and nara would like to say goodbye and

source: KAMU GAK BERHAK MENASEHATIKU!
en: you have no right to tell me what to do!

source: WAUW.
en: wow!

source: MELAKUKAN INI!
en: to do this!

source: SIAL…
en: Crap...

source: MEMANGGIL OM
en: you

source: SINGKIRKAN TANGANMU!
en: get your hands off of me!

source: BTW, HABIS ITU
en: Oh, by the way,

source: SYUUT
en: fwip

source: TENTU, GUA FRONT MAN KALIAN!
en: of course, I’m the front man!

source: BAGAIMAA BISA?!
en: what is happening?!

source: APA?
en: what?!

source: ANTAGONIS
en: of an antagonist

source: NAMUN TAK KUSANGKA
en: To my surprise,

source: SEMUA SUDAH KUPERHITUNGKAN, DI SAAT GENTING SEPERTI INI…
en: I’ve calculated everything, for a moment like this...

source: MEREKA PENYUSUP!
en: they’re intruders! get them!

source: GUA LUMAYAN TERHIBUR.
en: This was quite entertaining!

source: BERANTAKIN HIDUP GUA.
en: has messed up my life.

source: YA,
en: Yup,

source: GOSIP APAPUN AKAN MANTUL!
en: I’ll face those hoaxes head on!

source: MENENDANG
en: in

source: PAPA?
en: dad?

source: BLACK CAMPAIGN!
en: roam the streets!

source: LU TAHU DIJEBAK DAN LU MASIH BELAGAK BEGO?
en: so you knew this was a trap and you were still pretending to not know anything?!

source: MELAWAN
en: has nothing

source: HEH, APAAN TUH ALASANNYA?!
en: what kind of a reason is that?!

source: TENTU SAJA AKU PERCAYA KAMU, KAMU KAN SERING NOLONG AKU SEJAK AWAL DI SINI.
en: of course! you’ve helped me a lot since I came to this school!

source: KESALAHAN PARA MURID
en: on the students

source: GADIS CILIK…
en: kiddo...

source: BANGUN!!
en: in the fight!

source: BENAR SAJA!
en: kidding me!

source: EMANG IYA?
en: Really?

source: TAPI SEPERTINYA
en: well,

source: DENGAN JULUKAN ITU.
en: with your nickname.

source: SEKARANG ACARA BEBAS!
en: (incorrect segments, translation moved to the missing text sheet)

source: GUA SUKA
en: I like

source: LU MASIH
en: you’re still

source: KELUAR DULU
en: get out of

source: INTRO KEREN
en: my

source: EH, KAN UDAH LEWAT!
en: (incorrect segments, translation moved to the missing text sheet)

source: DI HITUNGAN
en: count of

source: INI?!
en: is this?!

source: SI DAMAR?
en: damar?

source: DUA KALI TADI…
en: we even did it twice, you know?

source: SEMANGKA INI
en: this watermelon plushie

source: BENAR-BENAR
en: she really

source: SUDAH MENYELESAIKAN URUSAN
en: taken care of

source: WOI, ANAK MOBA SAMA ANAK PREMAN!
en: hey, mr. gamer and mafia boy!

source: KAN GUA UDAH
en: I already

source: NGAMUK…
en: is in a bad mood...

source: DENGAN CARA:
en: they did this by

source: DAN SEGERA LAPORKAN KALAU ADA YANG MENCURIGAKAN!
en: report anything suspicious immediately!

source: KALAU BEGITU
en: amel and I

source: YAMERO!!
en: stop!

source: KALAU
en: if you want

source: JUGA?
en: too?

source: PULANG.
en: go home.

source: BEGINNER LUCK
en: your luck

source: LOH!
en: just now!

source: HARUSNYA IBU
en: I should have

source: EH…
en: Uh...

source: RAHASIAKU!
en: weapon!

source: PAS UNTUK
en: your

source: PIYA YA, PADAHAL
en: What’s up with him?!

source: JELASIN.
en: to fill you in with all the details, putra.

source: RATU SUDAH
en: ratu has

source: GIFT SHOP,
en: a gift shop?

source: MANA AKU
en: I am a

source: GUA TAHU,
en: I know

source: PILAR BESI MANA?
en: where are the iron pillars?

source: GAK?
en: pass?

source: DHUAR
en: Whack

source: BOCAH-BOCAH SMA!
en: of high schoolers!

source: AKU HARUS
en: Maybe I should

source: KEKURUNG?
en: What?

source: TITIP SALAM
en: to send

source: SEJAK SAAT ITU
en: since that moment

source: DUK
en: thud

source: STRES GAK ADA NARA, YA?
en: (incorrect segments, translation moved to the missing text sheet)

source: CIH, KITA BISA PAKAI KEKERASAN KALAU KALIAN NGGAK MAU PATUH!
en: tsk, if you refuse, then we’ll use violence!

source: LU EMANG KUAT, TAPI PASTI ADA ALASANNYA KENAPA LU LEVEL TERBAWAH DI PILAR BESI/
en: he’s strong, but there’s gotta be a reason he’s ranked the last among the pillars.

source: CIH, JANGAN MACAM-MACAM, YA1
en: tsk, over my dead body!

source: SEKOLAH INI YANG UDAH
en: school’s system

source: DAN
en: and his hair

source: PERTIKAIAN ANAK
en: these naughty

source: OKE…
en: okay.

source: AKU HARUS ANTAR ADIKNYA DIAN PULANG…
en: (incorrect segments, translation moved to the missing text sheet)

source: YAUDAH, SEMUA SIAP DI POSISI!
en: good, get into position, everyone!

source: KAMI SEBATAS
en: we’ll just gonna

source: INTINYA
en: the point is,

source: PILAR BESI SEHARUSNYA
en: the iron pillars should’ve already

source: KAMU BISA MENGUASAI
en: have you mastered

source: JANGAN BILANG LU--
en: don’t tell me--

source: EH, SOAL ITU…
en: uh, about that...

source: Kalau kamu emang gak mau datang bilang aja, lagian ada kamu atau nggak aku sebagai panitia tetap harus datang!
en: if you don’t want to come, just say so. with or without you, I still need to come as a committee!

source: NGEBANTU LU,
en: helped,

source: HIDUP…
en: alive...

source: SANGAT MENGGANGGU
en: annoying,

source: KA' DAMAR
en: damar,

source: GENEEEH,
en: helping,

source: SUMBER MASALAHNYA!
en: the source of the problem!

source: HM?
en: hmm?

source: MENDING LU
en: you’d better

source: KITA ADA JANJI BARENG PAPAMU!
en: we’ve got an appointment with your dad!

source: HAHA, BERCANDA DOANG LAGIAN GUA HARUS DI SINI.
en: hah..., just kidding. after all, I need to stand guard here.

source: ITU KATA-KATA
en: That

source: TAPI, ITU GAK PENTING.
en: That’s not important.

source: GUA GAK MAU
en: I don’t want

source: MUNGKIN
en: are like that,

source: DHUES
en: wham

source: DAN GAK TAHU
en: with

source: TIDAK
en: won’t

source: TAHU ATURAN,
en: some

source: GAK NGARUH
en: You losers

source: TEPATNYA
en: there are only

source: PENGORBANANKU…
en: at what I did for you...

source: NGELIATIN GUA?
en: looking at me?

source: BONI, SORI GA GAK BISA JENGUK LU!
en: sorry boni, I can’t pay you a visit!

source: SEPERTINYA SEKOLAH
en: I think they haven’t

source: SAAT ITU.
en: thinking.

source: NGEHUBUNGIN KAMU.
en: contacted you...

source: AKU UDAH
en: I’ve asked the iron pillars

source: ADA PUTRA YANG BISA
en: putra will be there

source: KE-KEKUATAN--
en: th-this power--

source: APA YANG TERJADI?
en: what’s going on?!

source: EMANG KENAPA?
en: so what?

source: AKU SUDAH
en: I

source: DIA NANGIS?
en: is he crying?

source: DAJAL!
en: my luck.

source: ORANG MATI,
en: so many dead

source: ANAK BUAH
en: my

source: LU DATANG
en: you’re

source: FEEDBACK-MU.
en: feedback.

source: PADAKU,
en: get

source: TENGKORAK BESI
en: iron skull

source: MASUK DAN--
en: get in here and--

source: DAN TIDAK MEMILIKI
en: and you didn’t even have

source: PUAS GUA!!
en: how satisfying!

source: DARI ATAS POHON
en: from the top of a tree,

source: JANGAN DIBAKAR DULU GOBL*K!!
en: hold the fire, you fool!

source: MENYELESAIKAN
en: to finish

source: MASIH HIDUP?
en: you’re still alive?

source: AHLI STRATEGI APAAN!
en: what kind of strategist are you?!

source: MEMPERINGATKAN HAL INI,
en: warned us about this.

source: SEJAK KAPAN ADA ORANG SEBANYAK INI?
en: why are there so many people here?!

source: DASAR GILA!
en: Have you gone mad?!

source: BAROTI FOR RI 1
en: baroto for ri 1

source: KITA MAU
en: yourself,

source: BERTAHANLAH!
en: Nara!

source: TADI ADA ORANG ANEH GITU DI KELASA!
en: (incorrect segments, translation moved to the missing text sheet)

source: GUA BIARIN DIA PERGI!
en: so I let her go!

source: SAMA GUA.
en: me.

source: MAU..
en: if you want...

source: CIH, OGAH!
en: tsk, heck no!

source: KALAU LAGI KESAL
en: he always

source: TERSERAH!
en: So?!

source: KAMU SUDAH
en: you’re

source: NIA…
en: Nia off.

source: SIH…
en: I guess...

source: HARUS BEKERJA SAMA
en: need to work with

source: TIDAK PERCAYA
en: believe that

source: SATU PILAR RUBUH!
en: one of the pillars is down!

source: KALIAN AKRAB!
en: were this close, huh?!

source: SAYA GAK DENGAR!
en: I can’t hear you!

source: AKU HAFAL TEMPO
en: I’ve memorized the pattern

source: BERANI JUGA
en: you have some guts

source: MERUSAK SUASANA!!
en: what a party pooper!

source: KARENA LU ANEH,
en: because you’re different,

source: DAN SEKARANG RASAKAN PEMBALASAN 1000 TAHUNKU!
en: now, enjoy my ultimate revenge!

source: YANG KAMU
en: your

source: LU MASIH GAK NGOMONG SAMA MEREKA, YA?
en: so, you still won’t talk to them, huh?

source: STRATCH
en: whoosh

source: MAMA TAHU KAMU SANGAT BENCI AYAHMU, TAPI TOLING LAKUKAN INI UNTUK MAMA…
en: I know you despise your dad, but please do this for me...

source: SOAL MEREKA AKU YAKIN MEREKA GAK BAKAL ANEH-ANEH.
en: about them, I’m pretty sure they won’t do anything out of the ordinary.

source: DILIHAT DARI
en: no matter

source: BERGABUNG DENGAN
en: to join

source: BISA APA?
en: an army!

source: JANGAN BILANG INI…
en: It can’t be...

source: TIDAK TAHU ATURAN MAIN,
en: you didn’t know the rules of the game,

source: SI GANTENG GALAK!
en: the pretty boy is angry!

source: NANGISNYA
en: done

source: YANG BERSEMANGAT,
en: young man,

source: BISA KUPERCAYA...
en: I could trust the most...

source: Duk
en: Thud

source: PERCUMA
en: There’s nothing we

source: LEBIH BAIK...
en: better...

source: EH, MAAF BOS.
en: oh, sorry, boss.

source: DI MANA
en: where

source: IYA, KAMU TAHU KAN BAD JUNIOR SEKARANG ULANG TAHUN!
en: yup! you know today is the anniversary of bad junior, right?

source: JENGUK RATUNYA.
en: be late.

source: LAGIAN LU
en: High schoolers like

source: DI PERANCIS!
en: in france!

source: KAMU KELIHATAN SENANG BANGET…
en: you seem in a good mood...

source: DAN KELALAIAN SEKOLAH.
en: and the school authorities.

source: NYATA!!
en: world!

source: NAPA MUNTAH, SIH!
en: Oi, don’t throw up!

source: MINTA MAAF
en: apologized

source: TEMAN LU KAYAK GINI LU MALAH SENYUM-SENYUM DARI TADI!
en: you’re friend is literally dying and you keep smiling like that!

source: ATAU...
en: or...

source: KELUAR SAMPAI
en: not until

source: DI SAAT-SAAT
en: we always

source: SEKARANG JUSTRU SITUASI YANG GENTING!
en: this is a crucial moment!

source: DAN LAGIAN LU KENAPA, SIH?
en: and what’s wrong with you?

source: EMANG JELEK,
en: is just that bad

source: WAW,
en: wow,

source: HUFT…
en: huff...

source: GUDANG LUKISAN
en: where he

source: DAN PEMADAM
en: Plus, the fire department

source: KENAPA LU
en: why do you

source: TIDAK HERAN KAMU ANAKKU…
en: you really are my son...

source: SUDAH GANTENG
en: I couldn’t bear

source: GAGAL MELAWAN
en: not

source: NGAPAIN LU TIBA-TIBA
en: why’d you suddenly show your

source: NINJA DI SINI.
en: ninjas around here..

source: DIRI SENDIRI,
en: yourself,

source: KATA-KATA ITU…
en: words again...

source: FATMAWATI
en: is still

source: KELEBIHANKU!
en: one of my fortes!

source: KAMU GAK APA-APA, MEL?
en: (incorrect segments, translation moved to the missing text sheet)

source: DIA TERLIHAT
en: she seemed

source: DARI KEAMANAN
en: from the secret service

source: TUH?
en: me!

source: AKU BAKAL KE PROM BARENG KAMU!
en: I’ll go to prom with you!

source: HEI, KA'!
en: hey!

source: SETAHUKU OFFICIALNYA TANGGAL 2 JANUARI, GAK MU--
en: as far as i know, their official anniversary is on January 2nd, it’s imposs--

source: LU ADE DI SONOH?!
en: what are you doing there?!

source: YA
en: yeah,

source: BERTINDAK SEJAUH INI
en: Taslim would go this far

source: INI DARURAT!
en: it’s an emergency!

source: SEPERTIMU BUTUH
en: like you will

source: WAAAH!
en: hooray!

source: HUA…
en: huff...

source: MACHO.
en: macho field.

source: RAJANYA
en: you’re

source: EH?
en: (incorrect segments, translation moved to the missing text sheet)

source: KUTU KAYAK KALIAN MAU ADA 100 BIJI TETAP AJA KUTU!
en: fleas will always be fleas, even if there are a hundred of them!

source: TENTU!
en: of course!

source: DAN INI GAK BAKAL LAMA KOK.
en: it won’t take long.

source: RAMBUTNYA
en: turned

source: APA-APAAN
en: what the heck

source: SOAL ITU…
en: about that...

source: PAPA?!
en: dad?!

source: IKUTI DAN DUKUNG TERUS YA ROMANCE.PUNCH
en: keep supporting and following romance punch

source: KOK!
en: shortcut!

source: EMANG GITU TAHU!
en: in love!

source: TE-TEX?
en: (incorrect segments, translation moved to the missing text sheet)

source: IKUTI DAN DUKUNG TERUS YA
en: follow and support us

source: BUAT RATU…
en: like it.

source: DARIPADE PIZZA, INI LEBIH ENAK!
en: this is better than pizza!

source: DRT
en: buzz

source: ANJRIT!!
en: so annoying!

source: LAPANGAN
en: field

source: NOMOR SATU.
en: friend,

source: SIAPA YANG
en: who did this

source: GIMANA?
en: what do you say?

source: MINTA MAAF.
en: apologized, remember?

source: MENYUSUL KE
en: macho

source: DARI SINI!
en: of here!

source: PELAN DIKIT DONG, BANG!
en: please slow down a bit!

source: NYUSUL DAMAR
en: Join that brawl

source: HALO, SEKIAN CERITA ROMANCE PUNCH,
en: Hello, everyone! Romance Punch has come to an end!

source: JA-JANGAN
en: Don’t

source: WOI!
en: hey!

source: BANGUN LAGI,
en: stay down,

source: AKU GAK SUKA
en: I don’t

source: JIKA MEREKA NGOTOT
en: if they insist

source: NGOMONG
en: it

source: ADIRA SAAT INI
en: adira

source: AKU CAPEK,
en: I’m exhausted,

source: Aku sedang bersama pilar besi
en: I’m with the iron pillars

source: GAK USAH
en: enough with this

source: NGAPAIN LU DI SINI?!
en: what are you doing here?!

source: AKU AKAN
en: I’m going to

source: KUDENGAR DIA
en: I heard his

source: TERJADI?
en: going on?

source: PUTRA MAH GILA!
en: putra was just being weird!

source: HIHIHI, SELANJUTNYA APA?
en: hahaha, what now?

source: LU MALAH ASIK
en: I can’t believe

source: NANTI
en: I’ll

source: SAJA…
en: with it...

source: DHAS
en: bam

source: JANGAN
en: You’ve got to be

source: SIAP-SIAP…
en: Ready

source: AKU KHAWATIR!
en: I’m just worried about them!

source: SEPERTINYA
en: I think

source: SAKIT BANGET.
en: no joke.

source: A-ANAK
en: s-

source: BIARKAN MEREKA
en: You know I need to teach

source: SEKARANG, HUH?
en: like this?

source: BAKAL SEDIH
en: she’ll get upset

source: PILAR TERAKHIR PUN
en: the last pillar

source: GUA SENDIRIAN…
en: that I’m alone

source: SEPERTINYA INI
en: this

source: NYARIIN SESUATU
en: buy something for Ratu...

source: CEWEK GILANYA
en: I guess the table

source: PAK
en: mr.

source: TA-TAPI~
en: b-but...

source: IKAN G .
en: fish g.

source: CUMAN PERLU
en: to wait

source: TAMPAN GINI LAGI…
en: handsome teenager with a scar...

source: MASALAH.
en: in trouble.

source: LAGI-LAGI
en: those

source: AKU DATANG
en: I’ve come

source: MENGGOYANGKAN
en: to demoralize

source: BOCAH INGUSAN!
en: Bucko!

source: SEOLAH-OLAH
en: say that as

source: DIA SEKARANG
en: disabled

source: SEPERTI ITU
en: really

source: NYALAKAN
en: Light it

source: HOI PENGANGGURAN!
en: hey, you hobo!

source: MELERAI KUCING,
en: I was trying to

source: UDAH TAHU SEKOLAHNYA BAKAL DIBAKAR KAN?
en: so the school will be burned down, huh?

source: AKU INGAT
en: I almost

source: BANGSAT!
en: You son of a-!

source: TK
en: stare

source: TUNGGU SAJA
en: I’ll bash your

source: SET
en: fwip

source: nara juga ada.
en: nara’s also here

source: TAPI
en: but

source: SEBELUM AKU
en: get out of here

source: KEBUKA, MEL?
en: hurry it up, Amel?!

source: GENTING JUGA!
en: got no time for this!

source: SOAL TELUR WAKTU
en: about that egg incident,

source: EH,
en: Huh?!

source: HAHA, GUA PENASARAN SAMA KEKUATAN LO!
en: haha... I just wanted to know your real power!

source: SATU JAM SEBELUM
en: one hour before

source: DI SINI.
en: part ways.

source: KETEMU JODOH
en: he here?!

source: DIA DILUPAKAN
en: aside

source: UDAH GILA LU?
en: have you lost your mind?!

source: KITA SESAMA CEWEK
en: we’re all girls, right?

source: TERLAMBAT…
en: I’m too late...

source: …SEKARANG
en: what’s your plan

source: MEREKA BERANTEM
en: they don’t fight

source: GAK DI SANA.
en: be there.

source: DIAN, SEBAGAI PEMICU MENG-
en: they used dian’s sister,

source: DHAR
en: boom

source: ORANG INI?
en: this dude?

source: KALAU GAK ADA
en: If it weren’t for you,

source: MUNGKIN INI CUMA PRANK DAN NARA TAHU MAKANYA DIA GAK DATANG?!
en: There’s a chance that this was just a prank and Nara had known about this from the beginning. That’s why he didn’t come.

source: DIA SUDAH
en: he’s

source: TAHU-TAHU GUA SADAR
en: but I ended up naked

source: GAK
en: it didn’t

source: BERSIAPLAH,
en: Get ready!

source: WHOOOS
en: whoosh

source: MAU KE SINI?
en: you’re coming?

source: DENGAN CARAKU.
en: my way!

source: DAN MENERIMA
en: and let him

source: TEPATNYA BERAPA?
en: shut up?

source: FLICK ROYAL!
en: in flick royale!

source: LU BISA SERAHKAN MASALAH INI KE KITA… PILAR BESI…
en: let the iron pillars take care of this...

source: LO GAK
en: learn

source: SERUDUJAN MAUT!!
en: ultimate headbutt!

source: KOK RASANYA
en: she seems

source: TAPI BUAT APA?!!
en: what for?!

source: HMM…
en: (incorrect segments, translation moved to the missing text sheet)

source: KAYAKNYA AKU MENDING PULANG…
en: (incorrect segments, translation moved to the missing text sheet)

source: MENGULUR WAKTU
en: to stall him so that

source: BERANTEM
en: They

source: PERAN
en: the role

source: TAHU!
en: had enough!

source: BANTUAN SEORANG KRU TV
en: a tv crew

source: BORING, TAHU!
en: weren’t there!

source: ITU SATU BAIT, PAK?
en: is that one line, sir?

source: SEKARANG
en: now

source: DENGAN OTOT
en: and his

source: BENCI GUA?
en: hate me?

source: AKU TAHU!
en: know!

source: YA…
en: you’re right...

source: NIH, AMBIL JAKET GUA!
en: here, use my jacket!

source: MEREKA DATANG
en: the last time they

source: BALAS BUDI
en: I’ll return the favor

source: B*NGS*T...
en: Bastards...

source: BARU NYAMPE UDAH GRASAK GRUSUK, DAH!!
en: you just got back for god’s sake, calm down!

source: LULUS,
en: did you

source: DAN JANJI BAKAL
en: and I promise

source: TENTU AJE
en: I want to

source: KEMAMPUAN.
en: at your limit.

source: MEREKA BAIK-BAIK SAJA!
en: they’re fine!

source: TETAP BERSEMANGAT
en: she still has that fire in her,

source: DIA GAK AKAN
en: he can’t cover two

source: SEPERTI ITU.
en: too...

source: CIH!
en: tsk!

source: KAYAK GITU!
en: will you?

source: BTW, SOAL PROM SAMA NARA...
en: by the way, about nara and the prom...

source: UUH…
en: huh...

source: BUKANNYA
en: Fatmawati hospital

source: BUKANNYA AMEL
en: aren’t you worried that

source: YANG PASTI
en: But, I know now that

source: EMANG ADA APA, MA?
en: what’s up, mom?

source: PENYERANGAN
en: the attack

source: ORANG-ORANG
en: one of the people

source: MASIH BELUM ADA KABAR DARI NARA…
en: we haven’t heard anything from nara...

source: INI AKAN
en: I got

source: LU ANNOYING SIH,
en: you’re annoying.

source: HANYA ORANG
en: only jerks

source: BERSEMANGAT
en: very eager earlier,

source: UNTUK MENYALAHKAN
en: to blame

source: SHRAK
en: slam

source: DAN NGAPAIN
en: why would she get

source: SUPIT
en: claws

source: URUSANNYA!!
en: his business!

source: HANYA SAJA
en: But, she’s

source: SEMAKIN BANYAK
en: a lot of

source: NANTI JUGA
en: they’d

source: KERINGIN BADAN
en: let’s dry

source: DAN LAPOR POLISI.
en: and has called the police!

source: LU BAHKAN CIUM GUA
en: about our kiss.

source: GAK NGERTI, SIH…
en: I have no idea...

source: GELOMBANG KEDUA.
en: start the second wave.

source: MENGALIHKAN PEMBICARAAN TIBA-TIBAA
en: tries to change the topic.

source: APA RENCANA LU?
en: what’s your plan?

source: SATU BATU DOANG LANGSUNG PADA TAWURAN.
en: we just needed one pebble to stir up the fight.

source: CIH, MENTANG-MENTANG MAU KE PROM SAMA NARA!
en: tsk, is this because you’re going to prom with nara?!

source: TO-
en: h-

source: MARAHNYA!
en: Nara!

source: BERANTEM.
en: we’re in for a fight!

source: KALAU MAU…
en: if I need to..,

source: BERDUA NAIK ANGKOT
en: rode an angkot*

source: JATUH CINTA
en: happens when you fall

source: APA?!
en: what?!

source: KAMU KHAWATIR
en: you were worried that he’d

source: TAPI KENAPA AKU MASIH NGERASA KOSONG!
en: but why do I feel so empty?!
